In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_list,index= labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [8]:
#We can even save functions in a pandas series
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])

In [10]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,3,4],index = ['USA','Germany','Italy','Japan'])

In [12]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [13]:
ser1['USA']

1

In [14]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
from numpy.random import randn
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [42]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [18]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
df['new'] = df['W'] + df['Y']

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
#Removing Columns
df.drop('new',axis =1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [29]:
df.iloc[2] #Selecting based on position innstead of label

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [32]:
df.loc['B','Y'] #before comma it is row and after comma it is column

-0.8480769834036315

In [37]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [38]:
df = df[df>0]

In [40]:
df.fillna(0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118  0.000000  0.000000  0.605965  0.000000
C  0.000000  0.740122  0.528813  0.000000  0.000000
D  0.188695  0.000000  0.000000  0.955057  0.000000
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [45]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [43]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [46]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [47]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [48]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [54]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [49]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [56]:
df['USA'] = 'CA NY WY OR CO'.split()

In [57]:
df.set_index('USA')

            W         X         Y         Z
USA
CA   0.302665  1.693723 -1.706086 -1.159119
NY  -0.134841  0.390528  0.166905  0.184502
WY   0.807706  0.072960  0.638787  0.329646
OR  -0.497104 -0.754070 -0.943406  0.484752
CO  -0.116773  1.901755  0.238127  1.996652

In [64]:
df['new column'] = df.index

In [65]:
df

          W         X         Y         Z USA new column
A  0.302665  1.693723 -1.706086 -1.159119  CA          A
B -0.134841  0.390528  0.166905  0.184502  NY          B
C  0.807706  0.072960  0.638787  0.329646  WY          C
D -0.497104 -0.754070 -0.943406  0.484752  OR          D
E -0.116773  1.901755  0.238127  1.996652  CO          E

In [61]:
data = pd.read_csv('marklist.csv')

In [62]:
data

   Roll No.               Name  Age  Maths  Science  English
0      1001       Madhur Gupta   25     81       82       84
1      1002        Mukul Gupta   27     85       86       87
2      1003        Rajat Gupta   29     81       82       83
3      1004  Mayank Khandelwal   25     88       89       84
4      1005     Himanshu Goyal   25     87       86       85
5      1006        Prayas Jain   25     81       82       83
6      1007       Nitin Dhakad   25     86       85       89
7      1008  Gaurav Khandelwal   28     85       86       86
8      1009      Abhinav Gupta   26     84       86       85
9      1010      Arpit Rajpoot   25     82       84       84

In [66]:
data['Total Marks'] = data['Maths'] + data['Science'] + data['English']

In [67]:
data

   Roll No.               Name  Age  Maths  Science  English  Total Marks
0      1001       Madhur Gupta   25     81       82       84          247
1      1002        Mukul Gupta   27     85       86       87          258
2      1003        Rajat Gupta   29     81       82       83          246
3      1004  Mayank Khandelwal   25     88       89       84          261
4      1005     Himanshu Goyal   25     87       86       85          258
5      1006        Prayas Jain   25     81       82       83          246
6      1007       Nitin Dhakad   25     86       85       89          260
7      1008  Gaurav Khandelwal   28     85       86       86          257
8      1009      Abhinav Gupta   26     84       86       85          255
9      1010      Arpit Rajpoot   25     82       84       84          250

In [68]:
data.to_csv('marklist_1.csv')

In [96]:
pwd

'C:\\Users\\hp\\Class Exercises'

In [69]:
import os

In [70]:
os.getcwd()

'C:\\Users\\hp\\Class Exercises'

In [92]:
path =   os.getcwd() + '//..//..'

In [93]:
filename = 'marklist_1.csv'

In [94]:
path = os.path.join(path,filename)

In [95]:
pd.read_csv(path)

,Unnamed: 0,Roll No.,Name,Age,Maths,Science,English,Total Marks
0,0,1001,Madhur Gupta,25,81,82,84,247
1,1,1002,Mukul Gupta,27,85,86,87,258
2,2,1003,Rajat Gupta,29,81,82,83,246
3,3,1004,Mayank Khandelwal,25,88,89,84,261
4,4,1005,Himanshu Goyal,25,87,86,85,258
5,5,1006,Prayas Jain,25,81,82,83,246
6,6,1007,Nitin Dhakad,25,86,85,89,260
7,7,1008,Gaurav Khandelwal,28,85,86,86,257
8,8,1009,Abhinav Gupta,26,84,86,85,255
9,9,1010,Arpit Rajpoot,25,82,84,84,250